# Information Systems for Engineers Fall 2021 - Cheat Sheet

During the exam, you will be required to write SQL queries using a Jupyter notebook.

This notebook is designed to help you start writing your queries by providing you an environment with the datasets loaded and a simple query that you can use to recap the syntax of SQL.

Feel free to extend this notebook and use it for preparing the answers you need for the exam. Take into account that the content of this notebook will not be considered for grading.

## SQL

There is a local PostgreSQL 13 installation with a dataset loaded into a database. Run the next cell to connect to it.

In [1]:
%load_ext sql
%sql  postgresql://postgres:example@db

To print the tables currently loaded in the database run:

In [2]:
%%sql

SELECT * 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_TYPE = 'BASE TABLE' and TABLE_CATALOG = 'postgres' and TABLE_SCHEMA = 'public'
LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('postgres', 'public', 'categories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'customers', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'nwemployees', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'employeeterritories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None)]

To print the attributes of a particular table (`airports`, for example) run:

In [3]:
%%sql

SELECT column_name, data_type, character_maximum_length
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE table_name = 'airports';

 * postgresql://postgres:***@db
6 rows affected.

[('latitude', 'double precision', None),
 ('longtide', 'double precision', None),
 ('code', 'character varying', 5),
 ('name', 'character varying', 80),
 ('city', 'character varying', 40),
 ('residence', 'character varying', 2)]

## Useful SQL Keywords

The Keyword `SELECT DISTINCT` is used to return only distinct values. For example:

In [4]:
%%sql
SELECT DISTINCT residence FROM airlines;

 * postgresql://postgres:***@db
11 rows affected.

[('NY',),
 ('WA',),
 ('CO',),
 ('AZ',),
 ('HI',),
 ('FL',),
 ('UT',),
 ('CA',),
 ('TX',),
 ('GA',),
 ('IL',)]

## Complex query example

More complex PostgreSQL queries would look like:

In [5]:
%%sql
SELECT airlines.residence, COUNT(airlines.code)
    FROM airlines INNER JOIN airports ON airlines.residence = airports.residence
    WHERE airlines.residence <> 'CA'
GROUP BY airlines.residence
ORDER BY airlines.residence;

 * postgresql://postgres:***@db
10 rows affected.

[('AZ', 4),
 ('CO', 10),
 ('FL', 17),
 ('GA', 14),
 ('HI', 5),
 ('IL', 7),
 ('NY', 14),
 ('TX', 72),
 ('UT', 5),
 ('WA', 4)]

## Exam database − data about flight delays in the US

The dataset consists of relations containing information such as airports, airlines, flights and flight irregularities. Tables include both real-world and synthetic data. 

Here is some basic information on the database tables.

### 1) `airlines` table

Contains the list of airlines serving flights in our database.

* `code` is the two-letter IATA code identifier of the airline

* `name` is the airline name

* `residence` is the two-letter code of the state of residence

In [6]:
%%sql
SELECT * FROM airlines;

 * postgresql://postgres:***@db
14 rows affected.

[('UA', 'United Air Lines Inc.', 'IL'),
 ('AA', 'American Airlines Inc.', 'TX'),
 ('US', 'US Airways Inc.', 'AZ'),
 ('F9', 'Frontier Airlines Inc.', 'CO'),
 ('B6', 'JetBlue Airways', 'NY'),
 ('OO', 'Skywest Airlines Inc.', 'UT'),
 ('AS', 'Alaska Airlines Inc.', 'WA'),
 ('NK', 'Spirit Air Lines', 'FL'),
 ('WN', 'Southwest Airlines Co.', 'TX'),
 ('DL', 'Delta Air Lines Inc.', 'GA'),
 ('EV', 'Atlantic Southeast Airlines', 'GA'),
 ('HA', 'Hawaiian Airlines Inc.', 'HI'),
 ('MQ', 'American Eagle Airlines Inc.', 'TX'),
 ('VX', 'Virgin America', 'CA')]

### 2) `airports` table

Contains the list of available airports.

* `code` is the two-letter IATA code identifier of the airport

* `name` is the airport name

* `city` is the name of the city where the airport is located

* `residence` is the two-letter code of the state in which airport is located

* `latitude` and `longitude` are floating-point numbers describing the geographical location of the airport

In [7]:
%%sql
SELECT * FROM airports LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('ABE', 'Lehigh Valley International Airport', 'Allentown', 'PA', 40.652359999999994, -75.4404),
 ('ABI', 'Abilene Regional Airport', 'Abilene', 'TX', 32.41132, -99.6819),
 ('ABQ', 'Albuquerque International Sunport', 'Albuquerque', 'NM', 35.04022, -106.60918999999998),
 ('ABR', 'Aberdeen Regional Airport', 'Aberdeen', 'SD', 45.449059999999996, -98.42183)]

### 3) `flights` table

Contains the list of flights conducted. This table contains many rows - careful when printing the data!

* `id` is the unique flight ID

* `flight_number` is the IATA flight code

* `airline` is the IATA code of the airline

* `departure` and `arrival` are the IATA codes of the departure and arrival airports

* `year`, `month`, and `day` are the integer values encoding the number of day, month and the year when the flight departed

* `load_factor` is a floating-point number in the range `[0-1]` that describes the load factor on the flight, i.e., the fraction of occupied passenger seats

In [8]:
%%sql
SELECT * FROM flights LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(0, '98', 'AS', 'ANC', 'SEA', 2015, 1, 1, 0.465),
 (1, '2336', 'AA', 'LAX', 'PBI', 2015, 1, 1, 0.507),
 (2, '840', 'US', 'SFO', 'CLT', 2015, 1, 1, 0.774),
 (3, '258', 'AA', 'LAX', 'MIA', 2015, 1, 1, 0.633)]

### 4) `flights_delay` table

Contains the information on flights delays and irregularities. This table contains many rows - careful when printing the data!

* `id` is the unique flight ID

* `arrival_delay` a positive value is the delay on arrival in minutes, a negative value indicates an early arrival in minutes

* `cancellation` and `divertion` are boolean flags indicating cancelled and diverted flights

In [9]:
%%sql
SELECT * FROM flights_delay LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(0, -22, False, False),
 (1, -9, False, False),
 (2, 5, False, False),
 (3, -9, False, False)]

##### Note: the examples provided above do not contain all the query operations you might need during the exam.

Now its your turn, you can write all your queries in new cells below. Feel free to add as many cells as needed.

---

# Round 1

In [10]:
%%sql
SELECT COUNT(DISTINCT name)
FROM airports;

 * postgresql://postgres:***@db
1 rows affected.

[(322,)]

In [11]:
%%sql 
SELECT COUNT(*)
FROM flights
WHERE departure = 'JFK';

 * postgresql://postgres:***@db
1 rows affected.

[(1827,)]

In [12]:
%%sql
SELECT airline, COUNT(*) AS count
FROM flights
WHERE year=2015 AND month=1 AND day=3
GROUP BY airline
ORDER BY COUNT(*) ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('VX', 160)]

In [13]:
%%sql
SELECT COUNT(DISTINCT departure)
FROM flights f
JOIN airports a
ON f.arrival = a.code
WHERE residence = 'IL';

 * postgresql://postgres:***@db
1 rows affected.

[(159,)]

In [14]:
%%sql 
SELECT COUNT(*)
FROM airports a2
JOIN
    (SELECT *
    FROM flights f
    JOIN airports a
    ON f.arrival = a.code) as r
ON r.departure = a2.code
WHERE a2.residence = r.residence
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(11761,)]

In [15]:
%%sql 

-- Direct Flights

SELECT COUNT(distinct a2.name)
FROM flights f
JOIN airports a
ON f.departure = a.code
JOIN airports a2
ON f.arrival = a2.code
WHERE f.departure = 'ABR';

 * postgresql://postgres:***@db
1 rows affected.

[(1,)]

In [16]:
%%sql

-- Connecting Flights

SELECT COUNT(DISTINCT f2.arrival)
FROM flights f
JOIN airports a
ON f.departure = a.code
JOIN airports a2
ON f.arrival = a2.code
JOIN flights f2
ON f.arrival = f2.departure AND f2.arrival != 'ABR' AND f.year = f2.year AND f.month = f2.month AND f.day = f2.day
WHERE f.departure = 'ABR'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(103,)]

In [17]:
%%sql
SELECT ROUND(AVG(arrival_delay), 2) AS avg_delay
FROM flights f
JOIN flights_delay d
ON f.id = d.flight_id
JOIN airlines al
ON f.airline = al.code
WHERE al.residence = 'GA' AND f.load_factor >= 0.5;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('12.71'),)]

---

# Round 2

In [18]:
%%sql
SELECT COUNT(DISTINCT code)
FROM airports
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(322,)]

In [19]:
%%sql
SELECT COUNT(*)
FROM flights
WHERE departure = 'JFK'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1827,)]

In [20]:
%%sql
SELECT airline, a.name, COUNT(id)
FROM flights f
JOIN airlines a
ON f.airline = a.code
WHERE year = 2015 AND month = 1 AND day = 3
GROUP BY airline, a.name
ORDER BY COUNT(id) ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('VX', 'Virgin America', 160)]

In [21]:
%%sql
SELECT COUNT(DISTINCT departure)
FROM flights f
JOIN airports a
ON f.arrival = a.code
WHERE residence = 'IL'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(159,)]

In [22]:
%%sql
SELECT COUNT(*)
FROM flights f
JOIN airports a1
ON f.arrival = a1.code
JOIN airports a2
ON f.departure = a2.code
WHERE a1.residence = a2.residence
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(11761,)]

In [23]:
%%sql

-- Direct Flights

SELECT COUNT(DISTINCT arrival)
FROM flights
WHERE departure = 'ABR'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1,)]

In [24]:
%%sql

-- Connecting Flights
SELECT COUNT(DISTINCT f2.arrival)
FROM flights f2
JOIN
    (SELECT *
    FROM flights f1
    WHERE f1.departure = 'ABR'
    LIMIT 10) AS r
ON r.arrival = f2.departure
WHERE r.year = f2.year AND r.month = f2.month AND r.day = f2.day;

 * postgresql://postgres:***@db
1 rows affected.

[(103,)]

In [25]:
%%sql
SELECT ROUND(AVG(arrival_delay),2) AS avg_delay
FROM flights f
JOIN flights_delay d
ON f.id = d.flight_id
JOIN airlines a
ON f.airline = a.code
WHERE a.residence = 'GA' AND f.load_factor >= 0.5
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('12.71'),)]

---

# Round 3

In [26]:
%%sql
SELECT COUNT(DISTINCT code)
FROM airports
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(322,)]

In [27]:
%%sql
SELECT COUNT(*)
FROM flights
WHERE departure='JFK'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1827,)]

In [28]:
%%sql
SELECT f.airline, a.name, COUNT(DISTINCT id) AS num_flights
FROM flights f
JOIN airlines a
ON f.airline = a.code
WHERE year = 2015 AND month = 1 AND day = 3
GROUP BY f.airline, a.name
ORDER BY num_flights ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('VX', 'Virgin America', 160)]

In [29]:
%%sql
SELECT COUNT(DISTINCT departure)
FROM flights f
JOIN airports a
ON f.arrival = a.code
WHERE a.residence = 'IL'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(159,)]

In [30]:
%%sql
SELECT COUNT(*)
FROM flights f
JOIN airports a1
ON f.departure = a1.code
JOIN airports a2
ON f.arrival = a2.code
WHERE a1.residence = a2.residence
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(11761,)]

In [31]:
%%sql

-- Direct Flights

SELECT COUNT(DISTINCT arrival)
FROM flights f
WHERE departure = 'ABR'

 * postgresql://postgres:***@db
1 rows affected.

[(1,)]

In [32]:
%%sql

-- Indirect Flights

SELECT COUNT(DISTINCT f2.arrival)
FROM flights f1
JOIN flights f2
ON  f1.arrival = f2.departure AND 
    f1.year = f2.year AND f1.month = f2.month AND f1.day = f2.day
WHERE f1.departure = 'ABR' AND f2.arrival != 'ABR'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(103,)]

In [33]:
%%sql
SELECT ROUND(AVG(arrival_delay),2) AS avg_delay
FROM flights f
JOIN flights_delay d
ON f.id = d.flight_id
JOIN airlines a
ON f.airline = a.code
WHERE a.residence = 'GA' AND f.load_factor >= 0.5
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('12.71'),)]

---

# Round 4

In [34]:
%%sql
SELECT COUNT(DISTINCT code)
FROM airports
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(322,)]

In [35]:
%%sql
SELECT COUNT(*)
FROM flights
WHERE departure = 'JFK'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1827,)]

In [36]:
%%sql
SELECT airline, COUNT(flight_number) AS num_f
FROM flights f
WHERE year = 2015 AND month = 1 AND day = 3
GROUP BY airline
ORDER BY num_f ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('VX', 160)]

In [37]:
%%sql
SELECT COUNT(DISTINCT departure)
FROM flights f
JOIN airports a
ON f.arrival = a.code
WHERE residence = 'IL'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(159,)]

In [38]:
%%sql
SELECT COUNT(*)
FROM flights f
JOIN airports a1
ON f.departure = a1.code
JOIN airports a2
ON f.arrival = a2.code
WHERE a1.residence = a2.residence
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(11761,)]

In [39]:
%%sql

--- Direct Flights

SELECT COUNT(DISTINCT arrival)
FROM flights f
WHERE departure = 'ABR'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1,)]

In [40]:
%%sql

--- Connecting Flights

SELECT COUNT(DISTINCT f2.arrival)
FROM flights f1 
JOIN flights f2
ON f1.arrival = f2.departure
WHERE f1.departure = 'ABR' AND f1.year = f2.year AND f1.month = f2.month AND f1.day = f2.day AND f2.arrival != 'ABR'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(103,)]

In [41]:
%%sql
SELECT ROUND(AVG(arrival_delay),2)
FROM flights f
JOIN airlines a
ON f.airline = a.code
JOIN flights_delay fd
ON fd.flight_id = f.id
WHERE a.residence = 'GA' AND f.load_factor >= 0.5
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('12.71'),)]

---

# Round 5

In [42]:
%%sql
SELECT COUNT(DISTINCT code)
FROM airports
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(322,)]

In [43]:
%%sql
SELECT COUNT(DISTINCT id)
FROM flights
WHERE departure = 'JFK'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1827,)]

In [44]:
%%sql
SELECT airline, COUNT(DISTINCT id) AS num_flights
FROM flights
WHERE year = 2015 AND month = 1 AND day = 3
GROUP BY airline
ORDER BY num_flights ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('VX', 160)]

In [45]:
%%sql
SELECT COUNT(DISTINCT departure)
FROM flights f
JOIN airports a
ON f.arrival = a.code
WHERE a.residence = 'IL'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(159,)]

In [46]:
%%sql
SELECT COUNT(*)
FROM flights f
JOIN airports a1
ON f.departure = a1.code
JOIN airports a2
ON f.arrival = a2.code
WHERE a1.residence = a2.residence
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(11761,)]

In [47]:
%%sql

--- Direct Flights ---

SELECT COUNT(DISTINCT arrival)
FROM flights
WHERE departure = 'ABR'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1,)]

In [48]:
%%sql

--- Connecting Flights ---

SELECT COUNT(DISTINCT f2.arrival)
FROM flights f1
JOIN flights f2
ON f1.arrival = f2.departure AND f1.year = f2.year AND f1.month = f2.month AND f1.day = f2.day AND f1.departure != f2.arrival
WHERE f1.departure = 'ABR'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(103,)]

In [49]:
%%sql
SELECT ROUND(AVG(fd.arrival_delay),2)
FROM flights f
JOIN flights_delay fd
ON f.id = fd.flight_id
JOIN airlines a
ON f.airline = a.code
WHERE a.residence = 'GA' AND f.load_factor >= 0.5
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('12.71'),)]

---

# Round 6

In [50]:
%%sql
SELECT COUNT(*)
FROM airports
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(322,)]

In [51]:
%%sql
SELECT COUNT(DISTINCT id)
FROM flights
WHERE departure = 'JFK'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1827,)]

In [52]:
%%sql
SELECT airline, COUNT(DISTINCT id) AS num_flights
FROM flights
WHERE year = 2015 AND month = 1 AND day = 3
GROUP BY airline
ORDER BY num_flights ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('VX', 160)]

In [53]:
%%sql
SELECT COUNT(DISTINCT departure)
FROM flights f
JOIN airports a
ON f.arrival = a.code
WHERE a.residence = 'IL'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(159,)]

In [54]:
%%sql
SELECT COUNT(*)
FROM flights f
JOIN airports a1
ON a1.code = f.arrival
JOIN airports a2
ON a2.code = f.departure
WHERE a1.residence = a2.residence
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(11761,)]

In [55]:
%%sql

--- Direct Flights

SELECT COUNT(DISTINCT arrival)
FROM flights
WHERE departure = 'ABR'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1,)]

In [56]:
%%sql

--- Connecting Flights

SELECT COUNT(DISTINCT f2.arrival)
FROM flights f1
JOIN flights f2
ON f1.departure = 'ABR' AND f1.arrival = f2.departure AND f1.day = f2.day AND f1.month = f2.month AND f1.year = f2.year AND NOT f1.departure = f2.arrival
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(103,)]

In [57]:
%%sql
SELECT ROUND(AVG(arrival_delay),2)
FROM flights f
JOIN airlines a
ON f.airline = a.code
JOIN flights_delay fd
ON fd.flight_id = f.id
WHERE a.residence = 'GA' AND f.load_factor >= 0.5
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('12.71'),)]

---

# Round 7

In [58]:
%%sql
SELECT COUNT(DISTINCT code)
FROM airports
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(322,)]

In [59]:
%%sql
SELECT COUNT(DISTINCT id)
FROM flights
WHERE departure = 'JFK'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1827,)]

In [60]:
%%sql
SELECT airline, COUNT(DISTINCT id) AS num_flights
FROM flights
WHERE day = 3 AND month = 1 AND year = 2015
GROUP BY airline
ORDER BY num_flights ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('VX', 160)]

In [61]:
%%sql
SELECT COUNT(DISTINCT departure)
FROM flights f
JOIN airports a
ON f.arrival = a.code
WHERE a.residence = 'IL'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(159,)]

In [62]:
%%sql
SELECT COUNT(DISTINCT id)
FROM flights f
JOIN airports a1
ON f.arrival = a1.code
JOIN airports a2
ON f.departure = a2.code
WHERE a1.residence = a2.residence
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(11761,)]

In [63]:
%%sql

--- Direct Flights

SELECT COUNT(DISTINCT arrival)
FROM flights
WHERE departure = 'ABR'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1,)]

In [64]:
%%sql

--- Connecting Flights

SELECT COUNT(DISTINCT f2.arrival)
FROM flights f1
JOIN flights f2
ON f1.arrival = f2.departure
WHERE f1.departure = 'ABR' AND f1.day = f2.day AND f1.month = f2.month AND f1.year = f2.year AND f1.departure != f2.arrival
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(103,)]

In [65]:
%%sql
SELECT ROUND(AVG(arrival_delay),2)
FROM flights f
JOIN flights_delay fd
ON f.id = fd.flight_id
JOIN airlines a
ON a.code = f.airline
WHERE a.residence = 'GA' AND f.load_factor >= 0.5
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('12.71'),)]

---

# Round 8

In [66]:
%%sql
SELECT COUNT(*)
FROM airports
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(322,)]

In [67]:
%%sql
SELECT COUNT(*)
FROM flights
WHERE departure = 'JFK'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1827,)]

In [68]:
%%sql
SELECT airline, COUNT(DISTINCT id) AS num_flights
FROM flights
WHERE day = 3 AND month = 1 AND year = 2015
GROUP BY airline
ORDER BY num_flights ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('VX', 160)]

In [69]:
%%sql
SELECT COUNT(DISTINCT departure)
FROM flights f
JOIN airports a
ON f.arrival = a.code
WHERE residence = 'IL'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(159,)]

In [70]:
%%sql
SELECT COUNT(DISTINCT id)
FROM flights f
JOIN airports a1
ON f.departure = a1.code
JOIN airports a2
ON f.arrival = a2.code
WHERE a1.residence = a2.residence
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(11761,)]

In [71]:
%%sql

--- DIRECT FLIGHTS

SELECT COUNT(DISTINCT arrival)
FROM flights
WHERE departure = 'ABR'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1,)]

In [72]:
%%sql

--- CONNECTING FLIGHTS

SELECT COUNT(DISTINCT f2.arrival)
FROM flights f1
JOIN flights f2
ON f1.arrival = f2.departure
WHERE f1.departure = 'ABR' AND f1.departure != f2.arrival AND f1.day = f2.day AND f1.month = f2.month AND f1.year = f2.year
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(103,)]

In [73]:
%%sql
SELECT ROUND(AVG(arrival_delay),2)
FROM flights f
JOIN airlines a
ON f.airline = a.code
JOIN flights_delay fd
ON fd.flight_id = f.id
WHERE a.residence = 'GA' AND load_factor >= 0.5
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('12.71'),)]

---

# Round 9

In [75]:
%%sql
SELECT COUNT(DISTINCT code)
FROM airports
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(322,)]

In [77]:
%%sql
SELECT COUNT(DISTINCT id)
FROM flights
WHERE departure = 'JFK'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1827,)]

In [83]:
%%sql
SELECT airline, COUNT(DISTINCT id) AS num_flights
FROM flights
WHERE day = 3 AND month = 1 AND year = 2015
GROUP BY airline
ORDER BY num_flights ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('VX', 160)]

In [88]:
%%sql
SELECT COUNT(DISTINCT departure)
FROM flights f
JOIN airports a
ON f.arrival = a.code
WHERE residence = 'IL'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(159,)]

In [91]:
%%sql
SELECT COUNT(DISTINCT id)
FROM flights f
JOIN airports a1
ON f.departure = a1.code
JOIN airports a2
ON f.arrival = a2.code
WHERE a1.residence = a2.residence
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(11761,)]

In [96]:
%%sql

--- DIRECT FLIGHTS

SELECT COUNT(DISTINCT arrival)
FROM flights
WHERE departure = 'ABR'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(1,)]

In [103]:
%%sql

--- CONNECTING FLIGHTS

SELECT COUNT(DISTINCT f2.arrival)
FROM flights f1
JOIN flights f2
ON f1.arrival = f2.departure
WHERE f1.departure = 'ABR' AND f1.departure != f2.arrival AND f1.day = f2.day AND f1.month = f2.month AND f1.year = f2.year
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(103,)]

In [110]:
%%sql
SELECT ROUND(AVG(arrival_delay),2)
FROM flights f
JOIN airlines a
ON f.airline = a.code
JOIN flights_delay fd
ON fd.flight_id = f.id
WHERE a.residence = 'GA' AND load_factor >= 0.5
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('12.71'),)]

In [ ]:
%%sql

LIMIT 10;

In [ ]:
%%sql

LIMIT 10;

---